Catalogs/ЛМ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ТипыКонтрагентовОтправителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ЛМ_ЯзыкиИнтерфейсаОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЛМ_ЯзыкиИнтерфейсаОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Русский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Украинский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛМ_КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЛМ_КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛМ_Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛМ_Контрагенты/Ext/ObjectModule.bsl
Перем НеОбновлятьВИССлужбыДоставки Экспорт;
Перем НадоОповестить;
Перем ЛицаДляУдаления;

Процедура ОбновитьКонтрагентаВИССлужбыДоставки() Экспорт
	Если НеОбновлятьВИССлужбыДоставки = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	НадоОповестить = Ложь;
	Если ЗначениеЗаполнено(Ссылка) И (Ссылка.Имя <> Имя ИЛИ Ссылка.Фамилия <> Фамилия ИЛИ Ссылка.Город <> Город  ИЛИ Ссылка.Телефон <> Телефон) Тогда
		ЛицаДляУдаления = Новый Массив;
		ГУИД = "";
		НадоОповестить = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛМ_КонтактныеЛица.Ссылка
		|ИЗ
		|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
		|ГДЕ
		|	ЛМ_КонтактныеЛица.Владелец = &Владелец
		|	И ЛМ_КонтактныеЛица.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			ЛицаДляУдаления.добавить(Выборка.Ссылка);
		КонецЦикла;	
	КонецЕсли;	
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Город) Тогда
		Сообщить("Не указан город контрагента");
		Отказ = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Город.ГУИД) тогда
		Сообщить("В выбранном городе контрагента не заполнен идентификатор");
		Отказ = Истина;
	КонецЕсли;	
		
	Если не ЗначениеЗаполнено(ЮрФизЛицо) тогда
		Сообщить("Не указано значение признака юридического/физического лица");
		Отказ = Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(ЮрФизЛицо.ГУИД) тогда
		Сообщить("В выбранном значении признака юоидического/физического лица не заполнен идентификатор");
		Отказ = Истина;
	КонецЕсли;	
	
	Если ЮрФизЛицо.ГУИД = "PrivatePerson" И Не ЗначениеЗаполнено(Телефон) тогда
		Сообщить("Не указан номер телефона");
		Отказ = Истина;
	КонецЕсли;	
	
	Если ЮрФизЛицо.ГУИД = "Organization" Тогда
		Если НЕ ЗначениеЗаполнено(СокрЛП(Наименование)) тогда
			Сообщить("Не указано наименование");
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СокрЛП(ЕДРПОУ)) тогда
			Сообщить("Не указан код ЕДРПОУ");
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ФормаСобственности) тогда
			Сообщить("Не указана форма собственности");
			Отказ = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(ФормаСобственности.ГУИД) тогда
			Отказ = Истина;
			Сообщить("В выбранной форме собственности не заполнен идентификатор");
		КонецЕсли;	
	Иначе	
		Если НЕ ЗначениеЗаполнено(СокрЛП(Имя)) тогда
			Сообщить("Не указано имя");
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СокрЛП(Фамилия)) тогда
			Сообщить("Не указана фамилия");
			Отказ = Истина;
		КонецЕсли;	
		//Если НЕ ЗначениеЗаполнено(СокрЛП(Отчество)) тогда
		//	Сообщить("Не указано отчество");
		//	Отказ = Истина;
		//КонецЕсли;	
	КонецЕсли;
		
	Если Отказ Тогда
		Сообщить("Контрагент не был записан/обновлен в информационной базе службы доставки", СтатусСообщения.Важное	);
		Возврат;
	КонецЕсли;	
		
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "Counterparty");
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураЗапроса.Вставить("calledMethod", "update");
	Иначе	
		СтруктураЗапроса.Вставить("calledMethod", "save");
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("CounterpartyProperty", ВидКонтрагента.ГУИД);
	СтруктураПараметров.Вставить("CityRef", Город.ГУИД);
	СтруктураПараметров.Вставить("CounterpartyType", ЮрФизЛицо.ГУИД);
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураПараметров.Вставить("Ref", ГУИД);
	КонецЕсли;
	
	Если ЮрФизЛицо.ГУИД = "Organization" Тогда
	//	СтруктураПараметров.Вставить("FirstName", СокрЛП(Наименование));
		СтруктураПараметров.Вставить("EDRPOU", СокрЛП(ЕДРПОУ));
		СтруктураПараметров.Вставить("OwnershipForm", СокрЛП(ФормаСобственности.ГУИД));
	Иначе	
		СтруктураПараметров.Вставить("FirstName", СокрЛП(Имя));
		СтруктураПараметров.Вставить("LastName", СокрЛП(Фамилия));
		СтруктураПараметров.Вставить("MiddleName", СокрЛП(Отчество));
		СтруктураПараметров.Вставить("Phone", Телефон);
	КонецЕсли;	
	
	СтруктураЗапроса.Вставить("methodProperties", СтруктураПараметров);
	Если Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Получить() = Перечисления.ЛМ_ЯзыкиИнтерфейсаОбмена.Украинский Тогда
		СтруктураЗапроса.Вставить("language", "ua");
	Иначе
		СтруктураЗапроса.Вставить("language", "ru");
	КонецЕсли;
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтруктураОтвета = ПолучитьСтруктуруОтвета(ДеревоОтвета);
	
	Если СтруктураОтвета.Свойство("Ref") И СтруктураОтвета.Ref <> ГУИД Тогда
		ГУИД = СтруктураОтвета.Ref;
	КонецЕсли;	
	Если СтруктураОтвета.Свойство("Ошибки") Тогда
		Ошибки = СтруктураОтвета.Ошибки;
		Для Каждого КлючЗнач Из Ошибки Цикл
			Сообщить(КлючЗнач.Ключ + ": " + КлючЗнач.Значение, СтатусСообщения.Важное);
		КонецЦикла;	
	КонецЕсли;	
	
	
	ТаблицаКонтактныхЛиц = Новый ТаблицаЗначений;
	ТаблицаКонтактныхЛиц.Колонки.Добавить("ГУИД", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36)));
	ТаблицаКонтактныхЛиц.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаКонтактныхЛиц.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаКонтактныхЛиц.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	ТаблицаКонтактныхЛиц.Колонки.Добавить("Телефон", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ТаблицаКонтактныхЛиц.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	
	Если СтруктураОтвета.Свойство("КонтактныеЛица") ТОгда
		Если ТипЗнч(СтруктураОтвета.КонтактныеЛица) = Тип("Массив") Тогда
			Для Каждого ТекКонтактноеЛицо Из СтруктураОтвета.КонтактныеЛица Цикл
				Если ТекКонтактноеЛицо.Свойство("Ref") ТОгда
					СтрТабл = ТаблицаКонтактныхЛиц.Добавить();
					СтрТабл.ГУИД = ТекКонтактноеЛицо.Ref;
					Если ТекКонтактноеЛицо.Свойство("FirstName") ТОгда
                    	СтрТабл.Имя = ТекКонтактноеЛицо.FirstName;
					КонецЕсли;
					Если ТекКонтактноеЛицо.Свойство("LastName") ТОгда
                    	СтрТабл.Фамилия = ТекКонтактноеЛицо.LastName;
					КонецЕсли;
					Если ТекКонтактноеЛицо.Свойство("MiddleName") ТОгда
                    	СтрТабл.Отчество = ТекКонтактноеЛицо.MiddleName;
					КонецЕсли;
					Если ТекКонтактноеЛицо.Свойство("Phones") ТОгда
                    	СтрТабл.Телефон = ТекКонтактноеЛицо.Phones;
					КонецЕсли;
					Если ТекКонтактноеЛицо.Свойство("Description") ТОгда
                    	СтрТабл.Наименование = ТекКонтактноеЛицо.Description;
					КонецЕсли;
					
				КонецЕсли; 	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ТЗ.ГУИД,
	|	ТЗ.Имя,
	|	ТЗ.Фамилия,
	|	ТЗ.Отчество,
	|	ТЗ.Наименование,
	|	ТЗ.Телефон
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛМ_КонтактныеЛица.Ссылка,
	|	ТЗ.ГУИД,
	|	ТЗ.Имя,
	|	ТЗ.Фамилия,
	|	ТЗ.Отчество,
	|	ТЗ.Наименование,
	|	ТЗ.Телефон
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
	|		ПО (ЛМ_КонтактныеЛица.ГУИД = ТЗ.ГУИД)
	|ГДЕ
	|	(ЛМ_КонтактныеЛица.Ссылка ЕСТЬ NULL 
	|			ИЛИ ТЗ.Имя <> ЛМ_КонтактныеЛица.Имя
	|			ИЛИ ТЗ.Фамилия <> ЛМ_КонтактныеЛица.Фамилия
	|			ИЛИ ТЗ.Отчество <> ЛМ_КонтактныеЛица.Отчество
	|			ИЛИ ТЗ.Телефон <> ЛМ_КонтактныеЛица.Телефон
	|			ИЛИ ЛМ_КонтактныеЛица.Владелец <> &Контрагент)";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос.УстановитьПараметр("Контрагент", Ссылка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ЛМ_КонтактныеЛица.Владелец <> &Контрагент", "");
	КонецЕсли; 	
	Запрос.УстановитьПараметр("ТЗ", ТаблицаКонтактныхЛиц);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) тогда
			Об = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Об = Справочники.ЛМ_КонтактныеЛица.СоздатьЭлемент();
		КонецЕсли;
		Об.НеОбновлятьВИССлужбыДоставки = Истина;
		Если ЗначениеЗаполнено(Ссылка) тогда
			Об.Владелец = Ссылка;
		Иначе
			БудущаяСсылка = Справочники.ЛМ_Контрагенты.ПолучитьСсылку();
			УстановитьСсылкуНового(БудущаяСсылка);
			Об.Владелец = БудущаяСсылка;
		КонецЕсли;	
		Об.ГУИД = Выборка.ГУИД;
		Об.Имя = Выборка.Имя;
		Об.Фамилия = Выборка.Фамилия;
		Об.Отчество = Выборка.Отчество;
		Если Не ЗначениеЗаполнено(Об.Наименование) Тогда
			Об.Наименование = Выборка.Наименование;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Телефон) Тогда
			Об.Телефон = Выборка.Телефон;
		Иначе
			Об.Телефон = Телефон;
		КонецЕсли;	
		Об.Записать();
		ОбменДанными.Загрузка = Истина;
	КонецЦикла;	
	
	
КонецПроцедуры	

Функция ПолучитьСтруктуруОтвета(ДеревоОтвета)
	
	СтруктураОтвета = Новый Структура;
	Для Каждого ТекСтрока из ДеревоОтвета.Строки Цикл
		Если ТекСтрока.Тег = "root" тогда
			Для Каждого ТекСтрока1 Из ТекСтрока.Строки цикл
				Если ТекСтрока1.Тег = "success" Тогда
					Если НЕ ТекСтрока1.Тело = "true" Тогда
					//	Возврат СтруктураОтвета;
					КонецЕсли; 	
				ИначеЕсли ТекСтрока1.Тег = "errors" Тогда
					Ошибки = Новый Структура;
					Для Каждого ТекСтрока2 Из ТекСтрока1.Строки Цикл
						Если ЗначениеЗаполнено(ТекСтрока2.Тег) и ЗначениеЗаполнено(ТекСтрока2.Тело) Тогда
							Ошибки.Вставить(ТекСтрока2.Тег, ТекСтрока2.Тело);
						КонецЕсли;	
				    КонецЦикла;
				    СтруктураОтвета.Вставить("Ошибки", Ошибки);
				ИначеЕсли ТекСтрока1.Тег = "data" Тогда
					Для Каждого ТекСтрока2 Из ТекСтрока1.Строки Цикл
						Если ТекСтрока2.Тег = "item" Тогда
							Для Каждого ТекСтрока3 Из ТекСтрока2.Строки Цикл
								
								Если ТекСтрока3.Тег = "Ref" 
									ИЛИ ТекСтрока3.Тег = "Description"
									ИЛИ ТекСтрока3.Тег = "FirstName"
									ИЛИ ТекСтрока3.Тег = "MiddleName"
									ИЛИ ТекСтрока3.Тег = "LastName"
									ИЛИ ТекСтрока3.Тег = "OwnershipForm"
									ИЛИ ТекСтрока3.Тег = "CounterpartyType"
									Тогда
									
									СтруктураОтвета.Вставить(ТекСтрока3.Тег,ТекСтрока3.Тело);
								ИначеЕсли ТекСтрока3.Тег = "ContactPerson" Тогда
									Для Каждого ТекСТрока4 Из ТекСТрока3.Строки Цикл
										Если ТекСТрока4.Тег = "success" Тогда
											Если Не ТекСТрока4.Тело = "true" Тогда
												Прервать;
											КонецЕсли;
										ИначеЕсли 	ТекСТрока4.Тег = "data" Тогда
											МассивКонтактныхЛиц = Новый Массив;
											Для Каждого ТекСтрока5 Из ТекСТрока4.Строки Цикл
												Если ТекСтрока5.Тег = "item" Тогда
													СтруктураКонтактногоЛица = Новый Структура;
													Для Каждого ТекСтрока6 Из ТекСтрока5.Строки Цикл
														Если ТекСтрока6.Тег = "Ref" 
															ИЛИ ТекСтрока6.Тег = "Description" 								
															ИЛИ ТекСтрока6.Тег = "LastName" 								
															ИЛИ ТекСтрока6.Тег = "FirstName" 								
															ИЛИ ТекСтрока6.Тег = "MiddleName" 								
															ИЛИ ТекСтрока6.Тег = "Phones"
															Тогда
															СтруктураКонтактногоЛица.Вставить(ТекСтрока6.Тег, ТекСтрока6.Тело);
														КонецЕсли;
													КонецЦикла;
													МассивКонтактныхЛиц.Добавить(СтруктураКонтактногоЛица);
												КонецЕсли;	
											КонецЦикла;	
											Если МассивКонтактныхЛиц.Количество() > 0 Тогда
												СтруктураОтвета.Вставить("КонтактныеЛица", МассивКонтактныхЛиц);
											КонецЕсли;
										КонецЕсли;	
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;	
	Возврат СтруктураОтвета;
	
КонецФункции	

Процедура ПередЗаписью(Отказ)
	ОбновитьКонтрагентаВИССлужбыДоставки();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГУИД = "";
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НадоОповестить = Истина Тогда
		//Для Каждого ТекЛицо Из ЛицаДляУдаления цикл
		//	Об = ТекЛицо.Получитьобъект();
		//	Об.ОбменДанными.Загрузка = истина;
		//	Об.ПометкаУдаления = истина;
		//	Об.Записать();
		//КонецЦикла;	
		//Оповестить("Изменен контрагент", Ссылка);
	КонецЕсли;	
КонецПроцедуры
